#include <iostream>

using namespace std;

int main()
{
    int n, mod;
    cin >> n;

    mod = 100000007;
    int dp[10000005][2];

    // เติมได้ 3 แบบ --> 00 หน้า หลัง , 01 หน้า หลัง , 10 หน้าหลัง --> 01 = [[0, 1]]
    dp[1][0] = 1; //--> [[0], [0]]
    dp[1][1] = 2; //--> [[1,0], [0,1]]

    for(int i = 2; i <= n; i++){
        // เติม [0,0] ของหลัง ( เติมจากตัวเก่าทั้งหมดได้เลย )
        dp[i][0] = (dp[i-1][0] + dp[i-1][1]) % mod;

        // เติมจาก 1 ตัวเก่า --> 0+1  กับ 1 0   + พวก 0 ตัวเก่าทั้งหมด เติมได้ทั้ง [0, 1] และ [1, 0]
        //ฟ                          1+0       0 1
        dp[i][1] = (dp[i-1][1] + (2* dp[i-1][0])%mod) % mod;

    }
    cout << (dp[n][1] + dp[n][0])%mod;


    return 0;
}
